tutorials/precice/twophase_left/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/Parameters"
actions
(
    {
        name    atmosphere;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-1 #calc "$h - 0.0001" 0)($l #calc "$h + 0.0001" 1);
    }
);

// ************************************************************************* //
